In [41]:
import pandas as pd

### How to import data from CSV, API(JSON), SQL databases and display hold it using a data frame onject

### show a few rows.

In [42]:
df_movies.head()

,imdb_title_id,title,original_title,year,date_published,genre,duration,country,language,director,...,actors,description,avg_vote,votes,budget,usa_gross_income,worlwide_gross_income,metascore,reviews_from_users,reviews_from_critics
0,tt0000574,The Story of the Kelly Gang,The Story of the Kelly Gang,1906,1906-12-26,"Biography, Crime, Drama",70,Australia,NaN,Charles Tait,...,"Elizabeth Tait, John Tait, Norman Campbell, Be...",True story of notorious Australian outlaw Ned ...,6.1,537,$ 2250,NaN,NaN,NaN,7.0,7.0
1,tt0001892,Den sorte drøm,Den sorte drøm,1911,1911-08-19,Drama,53,"Germany, Denmark",NaN,Urban Gad,...,"Asta Nielsen, Valdemar Psilander, Gunnar Helse...",Two men of high rank are both wooing the beaut...,5.9,171,NaN,NaN,NaN,NaN,4.0,2.0
2,tt0002101,Cleopatra,Cleopatra,1912,1912-11-13,"Drama, History",100,USA,English,Charles L. Gaskill,...,"Helen Gardner, Pearl Sindelar, Miss Fielding, ...",The fabled queen of Egypt's affair with Roman ...,5.2,420,$ 45000,NaN,NaN,NaN,24.0,3.0
3,tt0002130,L'Inferno,L'Inferno,1911,1911-03-06,"Adventure, Drama, Fantasy",68,Italy,Italian,"Francesco Bertolini, Adolfo Padovan",...,"Salvatore Papa, Arturo Pirovano, Giuseppe de L...",Loosely adapted from Dante's Divine Comedy and...,7.0,2019,NaN,NaN,NaN,NaN,28.0,14.0
4,tt0002199,"From the Manger to the Cross; or, Jesus of Naz...","From the Manger to the Cross; or, Jesus of Naz...",1912,1913,"Biography, Drama",60,USA,English,Sidney Olcott,...,"R. Henderson Bland, Percy Dyer, Gene Gauntier,...","An account of the life of Jesus Christ, based ...",5.7,438,NaN,NaN,NaN,NaN,12.0,5.0

In [43]:
df_movies = pd.read_csv("data/IMDb movies.csv")

In [44]:
df_movies.loc[4]

imdb_title_id                                                    tt0002199
title                    From the Manger to the Cross; or, Jesus of Naz...
original_title           From the Manger to the Cross; or, Jesus of Naz...
year                                                                  1912
date_published                                                        1913
genre                                                     Biography, Drama
duration                                                                60
country                                                                USA
language                                                           English
director                                                     Sidney Olcott
writer                                                       Gene Gauntier
production_company                                           Kalem Company
actors                   R. Henderson Bland, Percy Dyer, Gene Gauntier,...
description              An account of the life of Jesus Christ, based ...
avg_vote                                                               5.7
votes                                                                  438
budget                                                                 NaN
usa_gross_income                                                       NaN
worlwide_gross_income                                                  NaN
metascore                                                              NaN
reviews_from_users                                                      12
reviews_from_critics                                                     5
Name: 4, dtype: object

### Import new csv creating an index this time around using column imdb_titile_id 
* the imdb_title_id will no longer be a column in the data

In [46]:
df_movies = pd.read_csv("data/IMDb movies.csv", index_col='imdb_title_id')

In [47]:
df_movies.head(2)

,title,original_title,year,date_published,genre,duration,country,language,director,writer,...,actors,description,avg_vote,votes,budget,usa_gross_income,worlwide_gross_income,metascore,reviews_from_users,reviews_from_critics
imdb_title_id,,,,,,,,,,,,,,,,,,,,,
tt0000574,The Story of the Kelly Gang,The Story of the Kelly Gang,1906,1906-12-26,"Biography, Crime, Drama",70,Australia,NaN,Charles Tait,Charles Tait,...,"Elizabeth Tait, John Tait, Norman Campbell, Be...",True story of notorious Australian outlaw Ned ...,6.1,537,$ 2250,NaN,NaN,NaN,7.0,7.0
tt0001892,Den sorte drøm,Den sorte drøm,1911,1911-08-19,Drama,53,"Germany, Denmark",NaN,Urban Gad,"Urban Gad, Gebhard Schätzler-Perasini",...,"Asta Nielsen, Valdemar Psilander, Gunnar Helse...",Two men of high rank are both wooing the beaut...,5.9,171,NaN,NaN,NaN,NaN,4.0,2.0

In [48]:
df_movies.tail(4)

,title,original_title,year,date_published,genre,duration,country,language,director,writer,...,actors,description,avg_vote,votes,budget,usa_gross_income,worlwide_gross_income,metascore,reviews_from_users,reviews_from_critics
imdb_title_id,,,,,,,,,,,,,,,,,,,,,
tt9905412,Ottam,Ottam,2019,2019-03-08,Drama,120,India,Malayalam,Zam,Rajesh k Narayan,...,"Nandu Anand, Roshan Ullas, Manikandan R. Achar...","Set in Trivandrum, the story of Ottam unfolds ...",7.8,510,INR 4000000,NaN,$ 4791,NaN,NaN,NaN
tt9905462,Pengalila,Pengalila,2019,2019-03-08,Drama,111,India,Malayalam,T.V. Chandran,T.V. Chandran,...,"Lal, Akshara Kishor, Iniya, Narain, Renji Pani...",An unusual bond between a sixty year old Dalit...,8.4,604,INR 10000000,NaN,NaN,NaN,NaN,NaN
tt9911774,Padmavyuhathile Abhimanyu,Padmavyuhathile Abhimanyu,2019,2019-03-08,Drama,130,India,Malayalam,Vineesh Aaradya,"Vineesh Aaradya, Vineesh Aaradya",...,"Anoop Chandran, Indrans, Sona Nair, Simon Brit...",NaN,8.4,369,NaN,NaN,NaN,NaN,NaN,NaN
tt9914286,Sokagin Çocuklari,Sokagin Çocuklari,2019,2019-03-15,"Drama, Family",98,Turkey,Turkish,Ahmet Faik Akinci,"Ahmet Faik Akinci, Kasim Uçkan",...,"Ahmet Faik Akinci, Belma Mamati, Metin Keçeci,...",NaN,7.2,190,NaN,NaN,$ 2833,NaN,NaN,NaN

In [50]:
df_test = pd.read_csv("data/IMDb movies.csv")

In [51]:
df_test.head(1)

,imdb_title_id,title,original_title,year,date_published,genre,duration,country,language,director,...,actors,description,avg_vote,votes,budget,usa_gross_income,worlwide_gross_income,metascore,reviews_from_users,reviews_from_critics
0,tt0000574,The Story of the Kelly Gang,The Story of the Kelly Gang,1906,1906-12-26,"Biography, Crime, Drama",70,Australia,NaN,Charles Tait,...,"Elizabeth Tait, John Tait, Norman Campbell, Be...",True story of notorious Australian outlaw Ned ...,6.1,537,$ 2250,NaN,NaN,NaN,7.0,7.0

### Lets comfirmif the imdb_title_id is unique using the count fucntion and storing it in a set.

In [52]:
x = df_test['imdb_title_id']

In [53]:
x.count()

81273

In [54]:
x.count() == len(set(x))

True

In [55]:
df_movies.head(1)

,title,original_title,year,date_published,genre,duration,country,language,director,writer,...,actors,description,avg_vote,votes,budget,usa_gross_income,worlwide_gross_income,metascore,reviews_from_users,reviews_from_critics
imdb_title_id,,,,,,,,,,,,,,,,,,,,,
tt0000574,The Story of the Kelly Gang,The Story of the Kelly Gang,1906,1906-12-26,"Biography, Crime, Drama",70,Australia,NaN,Charles Tait,Charles Tait,...,"Elizabeth Tait, John Tait, Norman Campbell, Be...",True story of notorious Australian outlaw Ned ...,6.1,537,$ 2250,NaN,NaN,NaN,7.0,7.0

### Importing data from a REST API (JSON)
* API = interface where 2 systems are communicating with each other 
* JSON = for different languages 
* In python we decode JSON into dictionaries

In [56]:
df_posts = pd.read_json("https://jsonplaceholder.typicode.com/posts")

In [57]:
df_posts["userId"].count()

100

In [58]:
df_posts["userId"].count() == len(set(df_posts['id']))

True

In [59]:
df_posts.head(2)

,userId,id,title,body
0,1,1,sunt aut facere repellat provident occaecati e...,quia et suscipit\nsuscipit recusandae consequu...
1,1,2,qui est esse,est rerum tempore vitae\nsequi sint nihil repr...

In [60]:
df_posts.set_index('id', inplace=True)

In [61]:
!pip install psycopg2

Requirement already satisfied: psycopg2 in c:\users\user\anaconda3\lib\site-packages (2.8.5)

In [ ]:
import psycopg2 as ps

In [ ]:
con = ps.connect("host=localhost user=postgres password=20202020 dbname=sales_data")

In [ ]:
df_sales = pd.read_sql_query("SELECT * FROM sales", con)

In [ ]:
df_sales

In [ ]:
df_sales.head(2)

### Pre-requisites of EDA = exploratory data analysis 

* Run df.info() to check column/row frequency of null values.
* If more than half of the rows in a column have none/null/Na values, we drop the column. 
* If the null values are few we can replace them with mean/median/mode.
* Deal with duplicate values = remove and keep only one 

### Performing Descriptive statistics 

* Run describe() method on your df. = show mean/frequency/std/min/max/variance of contious variables(numbers only)
* Check relationship between contionous variables i.e. one column and another

In [63]:
df_movies = pd.read_csv("data/IMDb movies.csv", index_col='imdb_title_id')

In [64]:
df_movies.head(2)

,title,original_title,year,date_published,genre,duration,country,language,director,writer,...,actors,description,avg_vote,votes,budget,usa_gross_income,worlwide_gross_income,metascore,reviews_from_users,reviews_from_critics
imdb_title_id,,,,,,,,,,,,,,,,,,,,,
tt0000574,The Story of the Kelly Gang,The Story of the Kelly Gang,1906,1906-12-26,"Biography, Crime, Drama",70,Australia,NaN,Charles Tait,Charles Tait,...,"Elizabeth Tait, John Tait, Norman Campbell, Be...",True story of notorious Australian outlaw Ned ...,6.1,537,$ 2250,NaN,NaN,NaN,7.0,7.0
tt0001892,Den sorte drøm,Den sorte drøm,1911,1911-08-19,Drama,53,"Germany, Denmark",NaN,Urban Gad,"Urban Gad, Gebhard Schätzler-Perasini",...,"Asta Nielsen, Valdemar Psilander, Gunnar Helse...",Two men of high rank are both wooing the beaut...,5.9,171,NaN,NaN,NaN,NaN,4.0,2.0

In [65]:
df_movies.info()

<class 'pandas.core.frame.DataFrame'>
Index: 81273 entries, tt0000574 to tt9914286
Data columns (total 21 columns):
 #   Column                 Non-Null Count  Dtype
---  ------                 --------------  -----
 0   title                  81273 non-null  object
 1   original_title         81273 non-null  object
 2   year                   81273 non-null  int64
 3   date_published         81273 non-null  object
 4   genre                  81273 non-null  object
 5   duration               81273 non-null  int64
 6   country                81234 non-null  object
 7   language               80518 non-null  object
 8   director               81200 non-null  object
 9   writer                 79780 non-null  object
 10  production_company     76948 non-null  object
 11  actors                 81207 non-null  object
 12  description            78843 non-null  object
 13  avg_vote               81273 non-null  float64
 14  votes                  81273 non-null  int64
 15  budget                 22804 non-null  object
 16  usa_gross_income       15094 non-null  object
 17  worlwide_gross_income  29892 non-null  object
 18  metascore              12722 non-null  float64
 19  reviews_from_users     74196 non-null  float64
 20  reviews_from_critics   70286 non-null  float64
dtypes: float64(4), int64(3), object(14)
memory usage: 13.6+ MB

__Country seems to have 39 null values. How would we deal with it?__

 replace values with a measure of tendercy since they are few 
 we will use mode (most occurring) data type = obj(str)

NB: If say we needed the actors column in our objectives, we would have to remove all rows which don't have actors

If you are performing a qualitative not quantitative

__Budget column has 58469 (72%) null values. how would we deal with this scenario?__

We would drop the column because the null values are too many

__How would we deal with reviews_from_users?__

We would replace the null values with the mean. dtype = int.

### 1. Clean up our columns and check for duplicates

In [66]:
df_movies_one = pd.read_csv("data/imdb_data_1000.csv")

In [ ]:
# df_movies_one.head(1)

In [67]:
df_movies_one['Rank'].count() == len(set(df_movies_one['Rank']))

True

In [68]:
df_movies_one = pd.read_csv("data/imdb_data_1000.csv", index_col='Rank')

In [69]:
df_movies_one.head(1)

,Title,Genre,Description,Director,Actors,Year,Runtime (Minutes),Rating,Votes,Revenue (Millions),Metascore
Rank,,,,,,,,,,,
1,Guardians of the Galaxy,"Action,Adventure,Sci-Fi",A group of intergalactic criminals are forced ...,James Gunn,"Chris Pratt, Vin Diesel, Bradley Cooper, Zoe S...",2014,121,8.1,757074,333.13,76.0

In [70]:
df_movies_one.columns

Index(['Title', 'Genre', 'Description', 'Director', 'Actors', 'Year',
       'Runtime (Minutes)', 'Rating', 'Votes', 'Revenue (Millions)',
       'Metascore'],
      dtype='object')

In [129]:
df_movies_one.rename(columns = {" Runtime (Minutes)": "Runtime_minutes", "Revenue (Millions)": "Revenue_millions"}, inplace=True )

In [132]:
df_movies_one

,title,genre,description,director,actors,year,runtime_minutes,rating,votes,revenue_millions,metascore
Rank,,,,,,,,,,,
1,Guardians of the Galaxy,"Action,Adventure,Sci-Fi",A group of intergalactic criminals are forced ...,James Gunn,"Chris Pratt, Vin Diesel, Bradley Cooper, Zoe S...",2014,121,8.1,757074,333.13,76.0
2,Prometheus,"Adventure,Mystery,Sci-Fi","Following clues to the origin of mankind, a te...",Ridley Scott,"Noomi Rapace, Logan Marshall-Green, Michael Fa...",2012,124,7.0,485820,126.46,65.0
3,Split,"Horror,Thriller",Three girls are kidnapped by a man with a diag...,M. Night Shyamalan,"James McAvoy, Anya Taylor-Joy, Haley Lu Richar...",2016,117,7.3,157606,138.12,62.0
4,Sing,"Animation,Comedy,Family","In a city of humanoid animals, a hustling thea...",Christophe Lourdelet,"Matthew McConaughey,Reese Witherspoon, Seth Ma...",2016,108,7.2,60545,270.32,59.0
5,Suicide Squad,"Action,Adventure,Fantasy",A secret government agency recruits some of th...,David Ayer,"Will Smith, Jared Leto, Margot Robbie, Viola D...",2016,123,6.2,393727,325.02,40.0
...,...,...,...,...,...,...,...,...,...,...,...
996,Secret in Their Eyes,"Crime,Drama,Mystery","A tight-knit team of rising investigators, alo...",Billy Ray,"Chiwetel Ejiofor, Nicole Kidman, Julia Roberts...",2015,111,6.2,27585,NaN,45.0
997,Hostel: Part II,Horror,Three American college students studying abroa...,Eli Roth,"Lauren German, Heather Matarazzo, Bijou Philli...",2007,94,5.5,73152,17.54,46.0
998,Step Up 2: The Streets,"Drama,Music,Romance",Romantic sparks occur between two dance studen...,Jon M. Chu,"Robert Hoffman, Briana Evigan, Cassie Ventura,...",2008,98,6.2,70699,58.01,50.0
999,Search Party,"Adventure,Comedy",A pair of friends embark on a mission to reuni...,Scot Armstrong,"Adam Pally, T.J. Miller, Thomas Middleditch,Sh...",2014,93,5.6,4881,NaN,22.0
1000,Nine Lives,"Comedy,Family,Fantasy",A stuffy businessman finds himself trapped ins...,Barry Sonnenfeld,"Kevin Spacey, Jennifer Garner, Robbie Amell,Ch...",2016,87,5.3,12435,19.64,11.0

In [130]:
df_movies_one.columns = [c.lower() for c in df_movies_one.columns]

In [131]:
df_movies_one.columns

Index(['title', 'genre', 'description', 'director', 'actors', 'year',
       'runtime_minutes', 'rating', 'votes', 'revenue_millions', 'metascore'],
      dtype='object')

In [74]:
df_movies_one.columns = [c.lower() for c in df_movies_one]

In [75]:
df_movies_one.columns

Index(['title', 'genre', 'description', 'director', 'actors', 'year',
       'runtime_minutes', 'rating', 'votes', 'revenue_millions', 'metascore'],
      dtype='object')

In [76]:
# df_movies_one.columns = [c.upper() for c in df_movies_one]

In [77]:
# df_movies_one.columns

### 2. Checking for duplicates

In [78]:
df_movies_one.shape

(1000, 11)

In [79]:
df_movies_one.drop_duplicates()

,title,genre,description,director,actors,year,runtime_minutes,rating,votes,revenue_millions,metascore
Rank,,,,,,,,,,,
1,Guardians of the Galaxy,"Action,Adventure,Sci-Fi",A group of intergalactic criminals are forced ...,James Gunn,"Chris Pratt, Vin Diesel, Bradley Cooper, Zoe S...",2014,121,8.1,757074,333.13,76.0
2,Prometheus,"Adventure,Mystery,Sci-Fi","Following clues to the origin of mankind, a te...",Ridley Scott,"Noomi Rapace, Logan Marshall-Green, Michael Fa...",2012,124,7.0,485820,126.46,65.0
3,Split,"Horror,Thriller",Three girls are kidnapped by a man with a diag...,M. Night Shyamalan,"James McAvoy, Anya Taylor-Joy, Haley Lu Richar...",2016,117,7.3,157606,138.12,62.0
4,Sing,"Animation,Comedy,Family","In a city of humanoid animals, a hustling thea...",Christophe Lourdelet,"Matthew McConaughey,Reese Witherspoon, Seth Ma...",2016,108,7.2,60545,270.32,59.0
5,Suicide Squad,"Action,Adventure,Fantasy",A secret government agency recruits some of th...,David Ayer,"Will Smith, Jared Leto, Margot Robbie, Viola D...",2016,123,6.2,393727,325.02,40.0
...,...,...,...,...,...,...,...,...,...,...,...
996,Secret in Their Eyes,"Crime,Drama,Mystery","A tight-knit team of rising investigators, alo...",Billy Ray,"Chiwetel Ejiofor, Nicole Kidman, Julia Roberts...",2015,111,6.2,27585,NaN,45.0
997,Hostel: Part II,Horror,Three American college students studying abroa...,Eli Roth,"Lauren German, Heather Matarazzo, Bijou Philli...",2007,94,5.5,73152,17.54,46.0
998,Step Up 2: The Streets,"Drama,Music,Romance",Romantic sparks occur between two dance studen...,Jon M. Chu,"Robert Hoffman, Briana Evigan, Cassie Ventura,...",2008,98,6.2,70699,58.01,50.0
999,Search Party,"Adventure,Comedy",A pair of friends embark on a mission to reuni...,Scot Armstrong,"Adam Pally, T.J. Miller, Thomas Middleditch,Sh...",2014,93,5.6,4881,NaN,22.0
1000,Nine Lives,"Comedy,Family,Fantasy",A stuffy businessman finds himself trapped ins...,Barry Sonnenfeld,"Kevin Spacey, Jennifer Garner, Robbie Amell,Ch...",2016,87,5.3,12435,19.64,11.0

In [81]:
df_movies_one.drop_duplicates(keep = 'first', inplace=True)

In [82]:
df_movies_one.shape

(1000, 11)

In [83]:
df_movies_one.drop_duplicates(keep = 'last', inplace=True)

In [84]:
df_movies_one.shape

(1000, 11)

### 3. Create a temp dataframe, create duplicate values using append method

In [85]:
temp_df = df_movies_one.append(df_movies_one)

In [86]:
temp_df.shape

(2000, 11)

In [87]:
temp_df = temp_df.append(df_movies_one)

In [88]:
temp_df.shape

(3000, 11)

In [89]:
temp_df_one = temp_df.copy()

In [90]:
temp_df.drop_duplicates(inplace=True, keep= 'last')

In [91]:
temp_df.shape

(1000, 11)

In [92]:
temp_df_one.drop_duplicates(inplace=True, keep= False)

In [93]:
temp_df_one.shape

(0, 11)

In [94]:
df_movies.shape

(81273, 21)

In [95]:
df_movies_one.shape

(1000, 11)

In [96]:
# df combination

In [97]:
df_comb = df_movies_one.append(df_movies)

In [98]:
df_comb.shape

(82273, 24)

In [99]:
df_comb.columns

Index(['title', 'genre', 'description', 'director', 'actors', 'year',
       'runtime_minutes', 'rating', 'votes', 'revenue_millions', 'metascore',
       'original_title', 'date_published', 'duration', 'country', 'language',
       'writer', 'production_company', 'avg_vote', 'budget',
       'usa_gross_income', 'worlwide_gross_income', 'reviews_from_users',
       'reviews_from_critics'],
      dtype='object')

In [100]:
df_movies.columns

Index(['title', 'original_title', 'year', 'date_published', 'genre',
       'duration', 'country', 'language', 'director', 'writer',
       'production_company', 'actors', 'description', 'avg_vote', 'votes',
       'budget', 'usa_gross_income', 'worlwide_gross_income', 'metascore',
       'reviews_from_users', 'reviews_from_critics'],
      dtype='object')

In [101]:
df_movies_one.columns

Index(['title', 'genre', 'description', 'director', 'actors', 'year',
       'runtime_minutes', 'rating', 'votes', 'revenue_millions', 'metascore'],
      dtype='object')

### Working with missing values

In [102]:
# Get rid of rows or columns 
# replace the null values with non-null == imputation

In [103]:
df_movies_one.shape

(1000, 11)

In [104]:
df_movies_one.isnull()

,title,genre,description,director,actors,year,runtime_minutes,rating,votes,revenue_millions,metascore
Rank,,,,,,,,,,,
1,False,False,False,False,False,False,False,False,False,False,False
2,False,False,False,False,False,False,False,False,False,False,False
3,False,False,False,False,False,False,False,False,False,False,False
4,False,False,False,False,False,False,False,False,False,False,False
5,False,False,False,False,False,False,False,False,False,False,False
...,...,...,...,...,...,...,...,...,...,...,...
996,False,False,False,False,False,False,False,False,False,True,False
997,False,False,False,False,False,False,False,False,False,False,False
998,False,False,False,False,False,False,False,False,False,False,False
999,False,False,False,False,False,False,False,False,False,True,False
1000,False,False,False,False,False,False,False,False,False,False,False

In [105]:
df_nulls = df_movies_one.isnull()

In [106]:
df_nulls.sum()

title                 0
genre                 0
description           0
director              0
actors                0
year                  0
runtime_minutes       0
rating                0
votes                 0
revenue_millions    128
metascore            64
dtype: int64

In [107]:
#removes any row that has atleast one null value 
df_movies_one1 = df_movies_one.dropna()

In [108]:
df_movies_one1.shape

(838, 11)

In [109]:
df_movies_one2 = df_movies_one.copy()

In [110]:
# remove a column with atleast one null value

In [111]:
# axis = 1 == eliminate columns
df_movies_one2.dropna(axis=1, inplace=True)

In [112]:
df_movies_one2.shape

(1000, 9)

In [113]:
df_movies_one3 = df_movies_one.copy()

In [114]:
# axis = 0 == eliminate rows 
df_movies_one3.dropna(axis=0, inplace=True)

In [115]:
df_movies_one3.shape

(838, 11)

### Imputation

In [134]:
revenue = df_movies_one['revenue_millions']

In [135]:
revenue.head()

Rank
1    333.13
2    126.46
3    138.12
4    270.32
5    325.02
Name: revenue_millions, dtype: float64

In [136]:
type(revenue)

pandas.core.series.Series

In [137]:
revenue = df_movies_one[['revenue_millions']]

In [138]:
revenue.head()

      revenue_millions
Rank
1               333.13
2               126.46
3               138.12
4               270.32
5               325.02

In [139]:
rm = revenue.mean()

In [140]:
rm

revenue_millions    82.956376
dtype: float64

In [141]:
r_null = revenue.isna()

In [142]:
r_null.head()

      revenue_millions
Rank
1                False
2                False
3                False
4                False
5                False

In [143]:
df_movies_one4 = df_movies_one.copy()

In [144]:
# df_movies_one3['revenue_millions'].fillna(df_movies_one[revenue_millions].mean(),inplace=True)

NameError: name 'revenue_millions' is not defined

In [127]:
revenue.fillna(rm)

      revenue_millions
Rank
1           333.130000
2           126.460000
3           138.120000
4           270.320000
5           325.020000
...                ...
996          82.956376
997          17.540000
998          58.010000
999          82.956376
1000         19.640000

[1000 rows x 1 columns]

In [128]:
df_movies_one3.isnull().sum()

title               0
genre               0
description         0
director            0
actors              0
year                0
runtime_minutes     0
rating              0
votes               0
revenue_millions    0
metascore           0
dtype: int64

In [ ]:
# above the metascore became 64 so check it out